from typing import Union, Tuple


def doum_conveter(word: str) -> Union[Tuple[str, str], bool]:
    """
    두음 법칙 구현
    :param word: 단어
    :returns: tuple or bool
    """
    doum = {
        "라": "나",
        "락": "낙",
        "란": "난",
        "랄": "날",
        "람": "남",
        "랍": "납",
        "랑": "낭",
        "래": "내",
        "랭": "냉",
        "략": "약",
        "량": "양",
        "려": "여",
        "련": "연",
        "렬": "열",
        "렴": "염",
        "냑": "약",
        "냥": "양",
        "녀": "여",
        "녁": "역",
        "년": "연",
        "녈": "열",
        "념": "염",
        "렵": "엽",
        "녕": "영",
        "녜": "예",
        "령": "영",
        "례": "예",
        "로": "노",
        "록": "녹",
        "론": "논",
        "롱": "농",
        "뢰": "뇌",
        "뇨": "요",
        "료": "요",
        "룡": "용",
        "루": "누",
        "뉴": "유",
        "뉵": "육",
        "류": "유",
        "륙": "육",
        "륜": "윤",
        "률": "율",
        "륭": "융",
        "륵": "늑",
        "름": "늠",
        "릉": "능",
        "니": "이",
        "리": "이",
        "린": "인",
        "림": "임",
        "립": "입",
    }
    if word[-1] in doum.keys():
        return word[-1], doum[word[-1]]
    else:
        return False
